week6/w6d5/ninenine_cats/app/controllers/cats_controller.rb

  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2015-01-22"], ["sex", "F"], ["description", "   lasagna lover   "], ["updated_at", "2020-10-09 21:08:28.739531"], ["id", 1]]