week6/w6d4/art_share_api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "lynn"], ["email", "lynn@gmail.com"]]
---
    def create
        user = User.new(user_params) #params.require(:user).permit(:name, :email)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save